#Tarea 2 -- formulario de carga de datos y respuestas

En este notebook pueden ingresar sus respuestas a las preguntas de tarea 2, y asegurarse que sus comandos SQL funcionan de manera adecuada.



### Cargar SQLite y subir la base de datos a Google Colab

Cómo siempre, para poder ocupar el notebook, lo deben subir a https://colab.research.google.com

Luego, ejecutando el siguiente campo, se crea una instancia de servidor SQLite, se creará el esquema vista en el enunciado, y se cargarán los datos desde un google drive.

In [ ]:
%load_ext sql
!wget -O datos_T2.db --no-check-certificate https://drive.google.com/uc\?export\=download\&id\=1XHbkX4QCDeHQTPy_mOw68Wo8rqYMyY6o

%sql sqlite:///datos_T2.db

--2022-09-04 22:56:10--  https://drive.google.com/uc?export=download&id=1XHbkX4QCDeHQTPy_mOw68Wo8rqYMyY6o
Resolving drive.google.com (drive.google.com)... 173.194.214.102, 173.194.214.113, 173.194.214.100, ...
Connecting to drive.google.com (drive.google.com)|173.194.214.102|:443... connected.
HTTP request sent, awaiting response... 303 See Other
Location: https://doc-00-88-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/drr4kjrven10iedm78gmiftoeoq470mf/1662332100000/10980901926740711681/*/1XHbkX4QCDeHQTPy_mOw68Wo8rqYMyY6o?e=download&uuid=df470cd0-58eb-470e-b515-0dc8d969fb8e [following]
Warning: wildcards not supported in HTTP.
--2022-09-04 22:56:10--  https://doc-00-88-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/drr4kjrven10iedm78gmiftoeoq470mf/1662332100000/10980901926740711681/*/1XHbkX4QCDeHQTPy_mOw68Wo8rqYMyY6o?e=download&uuid=df470cd0-58eb-470e-b515-0dc8d969fb8e
Resolving doc-00-88-docs.googleusercontent.com (doc-00-88-docs.googleusercontent.com)... 173.194.210.132, 2607:f8b0:400c:c0f::84
Connecting to doc-00-88-docs.googleusercontent.com (doc-00-88-docs.googleusercontent.com)|173.194.210.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 118784 (116K) [application/octet-stream]
Saving to: ‘datos_T2.db’

datos_T2.db         100%[===================>] 116.00K  --.-KB/s    in 0.001s

2022-09-04 22:56:10 (121 MB/s) - ‘datos_T2.db’ saved [118784/118784]

'Connected: @datos_T2.db'

##Pregunta 1

Para asegurarse qué la base de datos está cargada, en esta pregunta deben correr una serie de comandos de tipo:
```
SELECT *
FROM NombreTabla
LIMIT 5; 
```

Por ejemplo, para ver la tabla `Persona`, puedes correr:

```
SELECT *
FROM Persona
LIMIT 5;
```

Dado que nuestras tablas tienen 100 o más tuplas, desplegaremos solo las primeras 5 con el comando `LIMIT 5`.

In [ ]:
%%sql
SELECT *
FROM Persona
LIMIT 10;

 * sqlite:///datos_T2.db
Done.

[('Brian Sanders', '442-30-8082', '127-998-7310', 'brian.sanders@mail.cl'),
 ('Caleb Simpson', '151-44-5451', '+1-741-621-2285', 'caleb.simpson@mail.cl'),
 ('Kelly Mccullough', '315-42-0080', '417-906-4707', 'kelly.mccullough@uc.cl'),
 ('Jason Martin', '562-11-8702', '5667649532', 'jason.martin@uc.cl'),
 ('Natalie Lane', '893-23-0369', '+1-942-497-5393x1664', 'natalie.lane@mail.cl'),
 ('Anthony Webb', '478-49-8503', '(130)054-3656x192', 'anthony.webb@mail.cl'),
 ('Richard Gray', '095-89-2210', '096.090.6329x151', 'richard.gray@email.com'),
 ('Dawn Bean', '728-96-9591', '168-425-8745', 'dawn.bean@email.com'),
 ('Rhonda Lindsey', '406-31-1394', '001-132-939-0715x707', 'rhonda.lindsey@uc.cl'),
 ('Rhonda Johnson', '084-44-2271', '(228)499-1221x6919', 'rhonda.johnson@mail.cl')]

In [ ]:
%%sql
SELECT *
FROM TallerDeportivo
LIMIT 10;

 * sqlite:///datos_T2.db
Done.

[(1, 'Taller deportivo 1', 'Felicia Rivera', '2023-03-24', '17:00', 8, 1, 'Handbol', 2, 7),
 (2, 'Taller deportivo 2', 'Tyler Ferguson', '2023-05-09', '11:00', 8, 1.5, 'Handbol', 2, 7),
 (3, 'Taller deportivo 3', 'Chris Bryant', '2023-01-16', '15:00', 6, 2, 'Voleibol', 2, 6),
 (4, 'Taller deportivo 4', 'Gregg Thompson', '2023-03-22', '13:00', 8, 2, 'Handbol', 2, 7),
 (5, 'Taller deportivo 5', 'Joanna Washington', '2022-06-30', '13:00', 2, 2, 'Voleibol', 2, 6),
 (6, 'Taller deportivo 6', 'John Reed', '2022-04-16', '11:00', 3, 1, 'Fútbol', 2, 11),
 (7, 'Taller deportivo 7', 'John Daugherty', '2023-06-10', '16:00', 7, 2, 'Zumba', 1, ''),
 (8, 'Taller deportivo 8', 'Ronald Andrews', '2023-05-30', '11:00', 4, 2, 'Zumba', 1, ''),
 (9, 'Taller deportivo 9', 'Melanie Avila', '2022-01-30', '16:00', 8, 1, 'Handbol', 2, 7),
 (10, 'Taller deportivo 10', 'Stephen Hubbard', '2023-03-29', '13:00', 10, 1, 'Zumba', 1, '')]

In [ ]:
%%sql
SELECT *
FROM TallerInstrumental
LIMIT 10;

 * sqlite:///datos_T2.db
Done.

[(101, 'Taller Instrumental 1', 'Mr. Michael Mcguire', '2022-11-03', '11:00', 4, 1, 'Trompeta', 12),
 (102, 'Taller Instrumental 2', 'Cameron Evans', '2022-01-04', '15:00', 3, 1.5, 'Bajo', 2),
 (103, 'Taller Instrumental 3', 'Sheila Lewis', '2022-04-04', '13:00', 8, 1.5, 'Guitarra', 4),
 (104, 'Taller Instrumental 4', 'Ebony Smith', '2022-10-25', '14:00', 3, 1, 'Guitarra', 4),
 (105, 'Taller Instrumental 5', 'Jose Powell', '2022-05-09', '17:00', 5, 1.5, 'Bajo', 21),
 (106, 'Taller Instrumental 6', 'Patrick Brock', '2022-05-07', '15:00', 10, 1.5, 'Violín', 10),
 (107, 'Taller Instrumental 7', 'Scott Steele', '2021-12-02', '14:00', 7, 2, 'Trompeta', 4),
 (108, 'Taller Instrumental 8', 'Jerome Sheppard', '2021-10-27', '13:00', 9, 2, 'Batería', 10),
 (109, 'Taller Instrumental 9', 'Richard Moore', '2023-05-28', '14:00', 3, 1.5, 'Piano', 5),
 (110, 'Taller Instrumental 10', 'Christine Smith', '2023-07-15', '17:00', 9, 1, 'Bajo', 9)]

In [ ]:
%%sql
SELECT *
FROM Lugar
LIMIT 10;

 * sqlite:///datos_T2.db
Done.

[(1, '8517 White Circle Suite 464West Christine, WY 25833', 54408, 92721, 'Glorialand', 'Syrian Arab Republic'),
 (2, '0394 Thompson Radial Apt. 440Martinburgh, WI 61668', 58837, 29150, 'Jacquelineborough', 'Saint Vincent and the Grenadines'),
 (3, '1241 Stevens Extension Suite 769Lopezshire, KS 78903', 23470, 49883, 'Troyberg', 'Bosnia and Herzegovina'),
 (4, '3031 Moore FallNorth Amandafort, HI 10818', 74384, 91003, 'East Eileenton', 'Palestinian Territory'),
 (5, '028 Julia StreamBarbaraburgh, FL 62048', 126, 75538, 'Port Katherineport', 'Marshall Islands'),
 (6, '762 Elizabeth ParksGarcialand, CA 41187', 1840, 99037, 'Harrishaven', 'Israel'),
 (7, '6981 Wong PathLake Alexanderborough, OK 10033', 338, 57444, 'Bellport', 'Kenya'),
 (8, '069 Torres VillageEast Davidchester, SD 62530', 90946, 23571, 'Williamsstad', 'United States Minor Outlying Islands'),
 (9, '22792 Joseph RanchLake Laurafort, NH 27501', 12085, 68226, 'New Johnstad', 'Holy See (Vatican City State)'),
 (10, '81057 Cody GatewayJohnton, NY 51771', 2192, 28432, 'West Miguelmouth', 'Kenya')]

In [ ]:
%%sql
SELECT *
FROM Participa
LIMIT 10;

 * sqlite:///datos_T2.db
Done.

[('227-40-2546', 134),
 ('716-91-2023', 94),
 ('222-10-5678', 138),
 ('097-65-5254', 191),
 ('509-82-0904', 133),
 ('592-98-6474', 89),
 ('106-26-6898', 130),
 ('069-79-3655', 170),
 ('197-77-2759', 140),
 ('811-50-8892', 141)]

In [ ]:
%%sql
SELECT *
FROM EstaEn
LIMIT 10;

 * sqlite:///datos_T2.db
Done.

[(1, 37),
 (2, 38),
 (3, 42),
 (4, 20),
 (5, 25),
 (6, 46),
 (7, 42),
 (8, 14),
 (9, 44),
 (10, 1)]

##Pregunta 2

Ahora que tenemos nuestra base de datos preparada, la podemos analizar en más detalles. En esta primera pregunta te pedimos encontrar la(s) persona(s) qué participa(n) en máxima cantidad de talleres que se realizan en **Honduras**. Se requiere escribir una consulta SQL que recupera esta información sobre nuestro esquema. Esto quiere decir que la consulta debe devolver esta misma información sobre cualquier instancia de nuestro esquema, y no solo con la instancia que estamos revisando.

In [ ]:
%%sql
SELECT Persona.rut, Persona.nombre 
From Participa, Persona
WHERE Participa.rut = Persona.rut
      AND Participa.idTaller IN (SELECT idTaller
                                FROM (
                                SELECT idTaller, MAX(Asistencia_Taller) Asistencia_Max
                                FROM(   
                                      SELECT Participa.idTaller, COUNT(Participa.rut) Asistencia_Taller
                                      From Participa, EstaEn, Lugar
                                      WHERE Participa.idTaller = EstaEn.idTaller
                                            AND EstaEn.idLugar = Lugar.id
                                            AND Lugar.nombrePais = 'Honduras'
                                      GROUP BY Participa.idTaller
                                      ORDER BY Asistencia_Taller DESC) AS Taller_asistente))

 * sqlite:///datos_T2.db
Done.

[('757-47-6075', 'Crystal Mitchell'),
 ('853-31-9682', 'Laura Wallace'),
 ('114-10-5754', 'Brittany Mills')]

##Pregunta 3

Ahora nos interesaría encontrar el nombre del deporte más popular. Para esto, escriba la consulta SQL que encuentra el nombre de deporte de taller deportivo con la mayor cantidad de participantes. De nuevo, tu consulta debe funcionar sobre cualquier instancia de nuestro esquema.

In [ ]:
%%sql
SELECT deporte AS Deporte_Más_Popular
FROM(
      SELECT Asistencia_Taller_Deportivo.deporte, MAX(Asistencia_Taller_Deportivo)
      FROM(   
            SELECT TallerDeportivo.deporte, COUNT(Participa.rut) AS Asistencia_Taller_Deportivo
            From Participa, TallerDeportivo
            WHERE Participa.idTaller = TallerDeportivo.id
            GROUP BY TallerDeportivo.deporte
            ORDER BY Asistencia_Taller_Deportivo DESC) AS Asistencia_Taller_Deportivo)

 * sqlite:///datos_T2.db
Done.

[('Basquetbol',)]

##Pregunta 4

Ahora para cada taller instrumental cuenta el número de gente con el correo “@uc” participando. Debes escribir una consulta SQL que devuelve el id del taller, nombre del instrumento, y el número de personas con el correo “@uc” inscritas a este taller. Para filtrar la gente participando, ocupa el comando LIKE, que permite buscar sobre un string.

In [59]:
%%sql
SELECT TallerInstrumental.id, TallerInstrumental.instrumento, COUNT(Participa.rut) AS Numero_Asistentes
FROM Participa, Persona, TallerInstrumental
WHERE Participa.rut = Persona.rut
      AND Participa.idTaller = TallerInstrumental.id
      AND Persona.correo LIKE '%@uc%'
      AND Participa.idTaller in (SELECT TallerInstrumental.id
                                  FROM TallerInstrumental)
GROUP BY TallerInstrumental.id, TallerInstrumental.instrumento
ORDER BY Numero_Asistentes DESC;

 * sqlite:///datos_T2.db
Done.

[(130, 'Guitarra', 2),
 (170, 'Bajo', 2),
 (102, 'Bajo', 1),
 (113, 'Batería', 1),
 (115, 'Batería', 1),
 (119, 'Violín', 1),
 (133, 'Bajo', 1),
 (134, 'Piano', 1),
 (136, 'Guitarra', 1),
 (138, 'Batería', 1),
 (154, 'Batería', 1),
 (158, 'Piano', 1),
 (165, 'Guitarra', 1),
 (167, 'Violín', 1),
 (179, 'Violín', 1),
 (188, 'Bajo', 1),
 (189, 'Piano', 1),
 (191, 'Guitarra', 1),
 (197, 'Trompeta', 1),
 (199, 'Piano', 1)]

##Pregunta 5

Para cada persona, computa la cantidad de talleres en cuales participa esta persona. Esto debe incluir tantos talleres deportivos, cómo talleres instrumentales. Una manera de resolver esta consulta es ocupando consultas anidadas en la cláusula `FROM`, computando dicho número para cada tipo de taller.

In [ ]:
#Empleando UNION
%%sql
SELECT Tabla_total.rut, SUM(Tabla_total.Participación_Taller_Deportivo) AS Participación_Total_Taller_Deportivo, SUM(Tabla_total.Participación_Taller_Instrumental) AS Participación_Total_Taller_Instrumental, (SUM(Tabla_total.Participación_Taller_Deportivo) + SUM(Tabla_total.Participación_Taller_Instrumental)) AS Participación_Total
FROM (
      SELECT Participa.rut, COUNT(Participa.idTaller) AS Participación_Taller_Deportivo, (COUNT(Participa.idTaller) - COUNT(Participa.idTaller)) AS Participación_Taller_Instrumental
      FROM Participa, TallerDeportivo
      WHERE Participa.idTaller = TallerDeportivo.id
            AND Participa.idTaller IN ( SELECT TallerDeportivo.id
                                        FROM TallerDeportivo
                                      )
      GROUP BY Participa.rut
      UNION
      SELECT Participa.rut, (COUNT(Participa.idTaller) - COUNT(Participa.idTaller)) AS Participación_Taller_Deportivo, COUNT(Participa.idTaller) AS Participación_Taller_Instrumental
      FROM Participa, TallerInstrumental
      WHERE Participa.idTaller = TallerInstrumental.id
            AND Participa.idTaller IN ( SELECT TallerInstrumental.id
                                        FROM TallerInstrumental
                                      )
      GROUP BY Participa.rut) AS Tabla_total
GROUP BY Tabla_total.rut
ORDER BY Participación_Total DESC;